---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.AreaReinforcementsCollision
source: html/cb2e4997-9d1e-fbb8-2f52-fd2742cb2185.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.AreaReinforcementsCollision Property

Area Reinforcements are colliding. Aligning the Major Directions, or changing the Additional Offsets, can prevent collision.

## Syntax (C#)
```csharp
public static FailureDefinitionId AreaReinforcementsCollision { get; }
```